# Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) 

a = int(input('Введите трехзнаное число:'))
sum = a%10 + a//10%10 + a //100
print(f'Сумма числе равна {sum}')

